* Portuguese

#+BEGIN: clocktable :scope subtree :maxlevel 2
#+CAPTION: Clock summary at [2025-09-03 Wed 20:19]
| Headline     | Time    |       |
|--------------+---------+-------|
| *Total time* | *12:15* |       |
|--------------+---------+-------|
| Portuguese   | 12:15   |       |
| \_  A1       |         | 12:15 |
#+END:

Mostly done using PracticePortuguese.com

** Timelines
- A1: 60-100 hours
- A2: 180-200 hours
- B1: 350-400 hours
- B2: 500-600 hours

** A1
*** Flashcards
CLOCK: [2025-08-21 Thu 21:00]--[2025-08-21 Thu 22:00] =>  1:00
CLOCK: [2025-08-22 Fri 21:00]--[2025-08-22 Fri 22:00] =>  1:00
CLOCK: [2025-08-23 Sat 21:00]--[2025-08-23 Sat 22:00] =>  1:00
CLOCK: [2025-08-24 Sun 21:00]--[2025-08-24 Sun 22:00] =>  1:00
CLOCK: [2025-08-25 Mon 21:00]--[2025-08-25 Mon 22:00] =>  1:00

*** Introduction
:LOGBOOK:
CLOCK: [2025-06-01 Sun 22:00]--[2025-06-01 Sun 22:10] =>  0:10
CLOCK: [2025-06-02 Mon 22:00]--[2025-06-02 Mon 22:10] =>  0:10
CLOCK: [2025-06-03 Tue 22:00]--[2025-06-03 Tue 22:10] =>  0:10
:END:

*** Greetings
:LOGBOOK:
CLOCK: [2025-06-07 Sat 22:00]--[2025-06-07 Sat 22:10] =>  0:10
CLOCK: [2025-06-08 Sun 22:00]--[2025-06-08 Sun 22:10] =>  0:10
CLOCK: [2025-06-09 Mon 22:00]--[2025-06-09 Mon 22:10] =>  0:10
CLOCK: [2025-06-10 Tue 22:00]--[2025-06-10 Tue 22:10] =>  0:10
CLOCK: [2025-06-11 Wed 22:00]--[2025-06-11 Wed 22:10] =>  0:10
CLOCK: [2025-06-12 Thu 22:00]--[2025-06-12 Thu 22:10] =>  0:10
CLOCK: [2025-06-13 Fri 22:00]--[2025-06-13 Fri 22:10] =>  0:10
CLOCK: [2025-06-14 Sat 22:00]--[2025-06-14 Sat 22:10] =>  0:10
CLOCK: [2025-06-15 Sun 22:00]--[2025-06-15 Sun 22:10] =>  0:10
CLOCK: [2025-06-16 Mon 22:00]--[2025-06-16 Mon 22:10] =>  0:10
:END:

*** Nouns
:LOGBOOK:
CLOCK: [2025-06-17 Tue 22:00]--[2025-06-17 Tue 22:10] =>  0:10
CLOCK: [2025-06-18 Wed 22:00]--[2025-06-18 Wed 22:10] =>  0:10
CLOCK: [2025-06-19 Thu 22:00]--[2025-06-19 Thu 22:10] =>  0:10
CLOCK: [2025-06-20 Fri 22:00]--[2025-06-20 Fri 22:10] =>  0:10
CLOCK: [2025-06-21 Sat 22:00]--[2025-06-21 Sat 22:10] =>  0:10
:END:

*** Introduction to Verbs
:LOGBOOK:
CLOCK: [2025-07-06 Sun 22:00]--[2025-07-06 Sun 22:10] =>  0:10
CLOCK: [2025-07-07 Mon 22:00]--[2025-07-07 Mon 22:10] =>  0:10
CLOCK: [2025-07-08 Tue 22:00]--[2025-07-08 Tue 22:10] =>  0:10
CLOCK: [2025-07-09 Wed 22:00]--[2025-07-09 Wed 22:10] =>  0:10
CLOCK: [2025-07-10 Thu 22:00]--[2025-07-10 Thu 22:10] =>  0:10
CLOCK: [2025-07-11 Fri 22:00]--[2025-07-11 Fri 22:10] =>  0:10
CLOCK: [2025-07-12 Sat 22:00]--[2025-07-12 Sat 22:10] =>  0:10
:END:

*** Basic grammar
:LOGBOOK:
CLOCK: [2025-07-13 Sun 22:00]--[2025-07-13 Sun 22:10] =>  0:10
CLOCK: [2025-07-14 Mon 22:00]--[2025-07-14 Mon 22:10] =>  0:10
CLOCK: [2025-07-15 Tue 22:00]--[2025-07-15 Tue 22:10] =>  0:10
CLOCK: [2025-07-16 Wed 22:00]--[2025-07-16 Wed 22:10] =>  0:10
CLOCK: [2025-07-17 Thu 22:00]--[2025-07-17 Thu 22:10] =>  0:10
CLOCK: [2025-07-18 Fri 22:00]--[2025-07-18 Fri 22:10] =>  0:10
CLOCK: [2025-07-19 Sat 22:00]--[2025-07-19 Sat 22:10] =>  0:10
:END:

*** Introduce yourself
:LOGBOOK:
CLOCK: [2025-07-20 Sun 22:00]--[2025-07-20 Sun 22:10] =>  0:10
CLOCK: [2025-07-21 Mon 22:00]--[2025-07-21 Mon 22:10] =>  0:10
CLOCK: [2025-07-22 Tue 22:00]--[2025-07-22 Tue 22:10] =>  0:10
CLOCK: [2025-07-23 Wed 22:00]--[2025-07-23 Wed 22:10] =>  0:10
:END:

*** Likes and dislikes
:LOGBOOK:
CLOCK: [2025-08-03 Sun 22:00]--[2025-08-03 Sun 22:10] =>  0:10
CLOCK: [2025-08-04 Mon 22:00]--[2025-08-04 Mon 22:10] =>  0:10
CLOCK: [2025-08-05 Tue 22:00]--[2025-08-05 Tue 22:10] =>  0:10
CLOCK: [2025-08-06 Wed 22:00]--[2025-08-06 Wed 22:10] =>  0:10
CLOCK: [2025-08-07 Thu 22:00]--[2025-08-07 Thu 22:10] =>  0:10
:END:

*** Informal you and formal you
:LOGBOOK:
CLOCK: [2025-08-28 Thu 19:40]--[2025-08-28 Thu 19:55] =>  0:15
CLOCK: [2025-08-27 Wed 22:03]--[2025-08-27 Wed 22:13] =>  0:10
CLOCK: [2025-08-26 Tue 22:03]--[2025-08-26 Tue 22:13] =>  0:10
CLOCK: [2025-08-25 Mon 22:03]--[2025-08-25 Mon 22:13] =>  0:10
CLOCK: [2025-08-24 Sun 22:03]--[2025-08-24 Sun 22:13] =>  0:10
CLOCK: [2025-09-02 Tue 03:00]--[2025-09-02 Tue 03:10] =>  0:10
:END:

*** Common Verbs 1
:LOGBOOK:
CLOCK: [2025-09-02 Tue 04:00]--[2025-09-02 Tue 04:10] =>  0:10
CLOCK: [2025-09-03 Wed 08:00]--[2025-09-03 Wed 08:10] =>  0:10
:END:
